# MajorLapSpliceLength Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricArea..::..MajorLapSpliceLength Property
FabricArea Class See Also
---
The fabric lap splice length in the fabric distribution in the major direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MajorLapSpliceLength { get; set; }
```

Visual Basic
---
```text
Public Property MajorLapSpliceLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MajorLapSpliceLength {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: majorLapSpliceLength is greater than the half of the overall length. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace